{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/06a7bffa-81e3-4726-9fa8-885879dbe415')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/06a7bffa-81e3-4726-9fa8-885879dbe415')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-09-01-preview",
            "properties": {
                "displayName": "SHQ - Data exfiltration monitoring via cloud platform",
                "description": "SHQ - Data exfiltration monitoring via cloud platform",
                "severity": "Medium",
                "enabled": true,
                "query": "DeviceNetworkEvents\r\n| where InitiatingProcessAccountName has_any (\"user1\", \"user2\", \"user3\", \"user4\")\r\n| where RemoteUrl has_any (\"onedrive\", \"mega.nz\", \"telegram\", \"dropbox\")",
                "queryFrequency": "PT5M",
                "queryPeriod": "PT5M",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [
                    "Exfiltration"
                ],
                "techniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "InitiatingProcessAccountDomain"
                            },
                            {
                                "identifier": "Name",
                                "columnName": "DeviceName"
                            },
                            {
                                "identifier": "DnsDomain",
                                "columnName": "RemoteUrl"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null
            }
        }
    ]
}